app/views/correos/_form.html.erb


      <%= f.association :user, :collection => User.where(:id => @correo.created_by), :label_method => :username, :value_method => :id , :disabled=>true,:label=>"Creado por"%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2

      <%=f.input :programa_id,:label=>"Programa" do%>
        <%= f.select :programa_id , Programa.all.map{ |c| ["" + c.nivel + "-" + c.programa, c.id] },:include_blank=>true%>
---
SELECT "programas".* FROM "programas"

      <%=f.input :por_periodo,:label=>"Periodo" do%>
        <%= f.select :por_periodo , PeriodoParaIngresar.all.map{ |c| [ c.valor, c.id] },:include_blank=>true%>
---
SELECT "periodo_para_ingresars".* FROM "periodo_para_ingresars"