app/views/llamadas/_form.html.erb

    <%=f.input :estado%>
    <%=f.input :efectividad, :label=>"Efectividad", :collection=>Efectividad.all,:label_method=>:valor%>
---
SELECT "efectividads".* FROM "efectividads"

      <%= f.hidden_field :created_by%>
      <%= f.association :user, :collection => User.where(:id => @llamada.created_by), :label_method => :username, :value_method => :id , :disabled=>true,:label=>"Creado por"%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3