app/views/shared/_breadcrumbs.html.erb

			when "prospectos"
				prospecto = Prospecto.where(:id=>model_id).first
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "767"]]

			when "solicitantes"
				prospecto = Prospecto.where(:id=>Solicitante.where(:id=>model_id).first.prospecto_id).first
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 14 LIMIT 1
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."id" = ? LIMIT 1  [["id", "14"]]

			when "examinados"
				prospecto = Prospecto.where(:id=>Solicitante.where(:id=>Examinado.where(:id=>model_id).first.solicitante_id).first.prospecto_id).first
---
SELECT "examinados".* FROM "examinados" WHERE "examinados"."id" = ? LIMIT 1  [["id", "25"]]
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."examinado_id" = 25 LIMIT 1

			when "admitidos"
				prospecto = Prospecto.where(:id=>Solicitante.where(:id=>Examinado.where(:id=>Admitido.where(:id=>model_id).first.examinado_id).first.solicitante_id).first.prospecto_id).first
---
SELECT "admitidos".* FROM "admitidos" WHERE "admitidos"."id" = ? LIMIT 1  [["id", 22]]