app/views/shared/_edit_solicitantes.html.erb

         <%
  @rolepermisions  = RolePermision.where(:role_id=>current_user.role,:objeto=>"becacreditos").first
---
SELECT "becacreditos".* FROM "becacreditos" WHERE "becacreditos"."solicitante_id" = 14
SELECT "role_permisions".* FROM "role_permisions" WHERE (("role_permisions"."role_id" = 9 AND "role_permisions"."objeto" = 'becacreditos')) LIMIT 1