app/views/shared/_edit_prospectos.html.erb

SELECT "sedes".* FROM "sedes" ORDER BY "sedes"."nombre"
SELECT "sedes".* FROM "sedes" WHERE "sedes"."id" = 1 LIMIT 1
---
if rol.nombre == "DN" or rol.nombre == "ACRM"
  sedesParaElCombo = Sede.order(:nombre)
else
  sedesParaElCombo = Sede.where(:id=>current_user.sede)

SELECT "nivels".* FROM "nivels"
SELECT "programas".* FROM "programas"
---
              <%=g.input :programa_id,:label=>"Programa" do%>
                <%= g.select :programa_id , Programa.all.map{ |c| ["" + c.nivel + "-" + c.programa , c.id] }%>

SELECT "direccions".* FROM "direccions" WHERE "direccions"."prospecto_id" = 767 LIMIT 1
---
            <%= builder.hidden_field :longitude%>
            <%= image_tag "http://maps.google.com/maps/api/staticmap?size=450x300&sensor=false&zoom=16&markers=#{@prospecto.direccions.first.latitude}%2C#{@prospecto.direccions.first.longitude}" %>

SELECT "prospectos".* FROM "prospectos"
---
              <%= builder.input :comentarios,:input_html => { :cols => 50, :rows => 3 }, :label=>"Comentarios:"%>
<%= builder.input :Referido,:label=>"Referido interno",:collection=>Prospecto.all.map{|c| [c.nombre + ' ' + ((c.apellido_paterno == nil) ? '' : c.apellido_paterno ) + ' ' + ((c.apellido_materno == nil) ? '' : c.apellido_materno),c.id] }.sort,:include_blank=>true%>