app/views/shared/_herramientas_upper.html.erb

					  	<li class="nav-header">Acciones</li>
					    <%rol = Role.where(:id=>current_user.role).first rescue nil%>
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1