app/views/shared/_history.html.erb

SELECT "histories".* FROM "histories" WHERE (("histories"."model_name" = 'prospectos' AND "histories"."model_id" = '767'))
---
<%	historiales =History.where(:model_name=>model_name ,:model_id=>model_id.to_s)%>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
			            <%
			            if User.where(:id=>historial.user_id) !=nil