app/views/shared/_save_search.html.erb

<%if request.path_parameters[:action] != "list"%>
<%searches = Search.where(:model_name=>request.path_parameters[:controller]).where(:user_id=>current_user.id).all%>
---
SELECT "searches".* FROM "searches" WHERE "searches"."model_name" = 'prospectos' AND "searches"."user_id" = 2