app/views/shared/_show_prospectos.html.erb

SELECT "interes_basicos".* FROM "interes_basicos" WHERE "interes_basicos"."prospecto_id" = 768 LIMIT 1
SELECT COUNT(*) FROM "interes_basicos" WHERE "interes_basicos"."prospecto_id" = 768
---

     <%if f.interes_basicos.empty?%>

SELECT "sedes".* FROM "sedes" WHERE "sedes"."id" = 1 LIMIT 1
SELECT "subsedes".* FROM "subsedes" WHERE "subsedes"."id" = 2 LIMIT 1
---
        <p>
          <%valor =f.interes_basicos.first.sede.nombre rescue "Sin Dato"
          valor = valor + " - " + f.interes_basicos.first.subsede.nombre rescue "Sin Dato" %>

SELECT "modalidads".* FROM "modalidads" WHERE "modalidads"."id" = 1 LIMIT 1
---
     <p>
          <%valor = f.interes_basicos.first.modalidad.valor rescue nil %>

SELECT "turnos".* FROM "turnos" WHERE "turnos"."id" = 1 LIMIT 1
---
        <p>
          <%valor = f.interes_basicos.first.turno.valor rescue nil %>

SELECT "interes_academicos".* FROM "interes_academicos" WHERE "interes_academicos"."prospecto_id" = 768 LIMIT 1
SELECT COUNT(*) FROM "interes_academicos" WHERE "interes_academicos"."prospecto_id" = 768
---
      </fieldset>
     <%if f.interes_academicos.empty?%>

SELECT "direccions".* FROM "direccions" WHERE "direccions"."prospecto_id" = 768 LIMIT 1
SELECT COUNT(*) FROM "direccions" WHERE "direccions"."prospecto_id" = 768
---
     <div class="tab-pane fade" id="direccion<%=prospectoid%>">
     <%if f.direccions.empty?%>

SELECT "medio_de_contactos".* FROM "medio_de_contactos" WHERE "medio_de_contactos"."prospecto_id" = 768 LIMIT 1
SELECT COUNT(*) FROM "medio_de_contactos" WHERE "medio_de_contactos"."prospecto_id" = 768
---
     <div class="tab-pane fade" id="medio<%=prospectoid%>">
     <%if f.medio_de_contactos.empty?%>

SELECT "plan_de_descuentos".* FROM "plan_de_descuentos" WHERE "plan_de_descuentos"."prospecto_id" = 768 LIMIT 1
SELECT COUNT(*) FROM "plan_de_descuentos" WHERE "plan_de_descuentos"."prospecto_id" = 768
---
     <div class="tab-pane fade" id="plandescuentos<%=prospectoid%>">
     <%if f.plan_de_descuentos.empty?%>