app/views/shared/_tareas.html.erb

SELECT "tareas".* FROM "tareas" WHERE (("tareas"."model_name" = 'programas' AND "tareas"."model_id" IS NULL))
---
  #render a partial for any tareas
	tareas =Tarea.where(:model_name=>request.path_parameters[:controller] ,:model_id=>model_id)