app/views/admitidos/index.html.erb

SELECT "tareas".* FROM "tareas" WHERE "tareas"."model_name" = 'admitidos' AND (("tareas"."model_id" = 22 AND "tareas"."pendiente" = 't'))
---
                          <%tareastatus=""%>
                          <%tareas = Tarea.where(:model_name=>"admitidos").where(:model_id=>admitido.id,:pendiente=>true).all%>

SELECT "llamadas".* FROM "llamadas" WHERE "llamadas"."model_name" = 'admitidos' AND (("llamadas"."model_id" = 22 AND "llamadas"."pendiente" = 't'))
---
                            <%end%>
                          <%tareas = Llamada.where(:model_name=>"admitidos").where(:model_id=>admitido.id,:pendiente=>true).all%>

SELECT "examinados".* FROM "examinados" WHERE "examinados"."admitido_id" = 22 LIMIT 1
SELECT COUNT(*) FROM "memos" WHERE "memos"."model_name" = 'examinados' AND (("memos"."model_id" = 22 AND "memos"."pendiente" = 't'))
---
                            <%end%>
                            <%tareas = Memo.where(:model_name=>"examinados").where(:model_id=>admitido.id,:pendiente=>true).size%>

SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 32 LIMIT 1
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."examinado_id" = 25 LIMIT 1
---
                              end%>
        <%if admitido.examinados.first ==nil or admitido.examinados.first.solicitantes.first==nil or admitido.examinados.first.solicitantes.first.prospectos.first == nil%>

SELECT "programas".* FROM "programas" WHERE "programas"."id" = 8 LIMIT 1
---
                <td><%= link_to admitido_path(admitido) do %>
                    <%= admitido.examinados.first.solicitantes.first.prospectos.first.programa.nivel rescue nil%> - <%= admitido.examinados.first.solicitantes.first.prospectos.first.programa.programa rescue nil%>