app/views/mi_plan_estrategico_de_promocion_peps/show.html.erb

    if @mi_plan_estrategico_de_promocion_pep.sede_id != nil
        Sede.where(:id=>@mi_plan_estrategico_de_promocion_pep.sede_id).first.nombre
---
SELECT "sedes".* FROM "sedes" WHERE "sedes"."id" = 4 LIMIT 1