app/views/prospectos/mostrarmultiple.html.erb

						when "nacionalidad"
							tabla = Nacionalidad.all rescue nil
---
SELECT "nacionalidads".* FROM "nacionalidads"

                          <%tareastatus=""%>
                          <%tareas = Tarea.where(:model_name=>"prospectos").where(:model_id=>prospecto.id,:pendiente=>true).all%>
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."model_name" = 'prospectos' AND (("tareas"."model_id" = 768 AND "tareas"."pendiente" = 't'))

                            <%end%>
                          <%tareas = Llamada.where(:model_name=>"prospectos").where(:model_id=>prospecto.id,:pendiente=>true).all%>
---
SELECT "llamadas".* FROM "llamadas" WHERE "llamadas"."model_name" = 'prospectos' AND (("llamadas"."model_id" = 768 AND "llamadas"."pendiente" = 't'))

                            <%end%>
                            <%tareas = Memo.where(:model_name=>"prospectos").where(:model_id=>prospecto.id,:pendiente=>true).size%>
---
SELECT COUNT(*) FROM "memos" WHERE "memos"."model_name" = 'prospectos' AND (("memos"."model_id" = 768 AND "memos"."pendiente" = 't'))