app/views/prospectos/printview.html.erb

  solid #7F7F7F 1.0pt;padding:0in 0in 0in 0in'>
  <p class=MsoNormal><%=printValue("Calle",@prospecto.direccions.first.calle)%></p>
---
SELECT "direccions".* FROM "direccions" WHERE "direccions"."prospecto_id" = 964 LIMIT 1

  solid #7F7F7F 1.0pt;padding:0in 0in 0in 0in'>
  <p class=MsoNormal><%valor=@prospecto.interes_basicos.first.ultimo_grado_de_estudio.grado_de_estudio rescue nil%>
---
SELECT "interes_basicos".* FROM "interes_basicos" WHERE "interes_basicos"."prospecto_id" = 964 LIMIT 1

  solid #7F7F7F 1.0pt;padding:0in 0in 0in 0in'>
  <p class=MsoNormal><span lang=ES><%valor =@prospecto.interes_basicos.first.sede.nombre rescue nil%>
---
SELECT "sedes".* FROM "sedes" WHERE "sedes"."id" = 1 LIMIT 1

  <p class=MsoNormal><span lang=ES><%
          valor =@prospecto.interes_basicos.first.subsede.nombre rescue nil %>
---
SELECT "subsedes".* FROM "subsedes" WHERE "subsedes"."id" = 2 LIMIT 1

  solid #7F7F7F 1.0pt;padding:0in 0in 0in 0in'>
  <p class=MsoNormal><span lang=ES><%valor = @prospecto.interes_basicos.first.modalidad.valor rescue nil %>
---
SELECT "modalidads".* FROM "modalidads" WHERE "modalidads"."id" = 1 LIMIT 1

  border-bottom:solid #7F7F7F 1.0pt;padding:0in 0in 0in 0in;height:43.5pt'>
  <p class=MsoNormal><span lang=ES><%=printValue("Opción 1",@prospecto.interes_academicos.first.opcion_1)%></span></p>
---
SELECT "interes_academicos".* FROM "interes_academicos" WHERE "interes_academicos"."prospecto_id" = 964 LIMIT 1

  <p class=MsoNormal><span lang=ES>        <p>
          <b><%=printMedio( @prospecto.medio_de_contactos.first.feria_universitaria_en_su_colegio,"Feria universitaria")%></b>
---
SELECT "medio_de_contactos".* FROM "medio_de_contactos" WHERE "medio_de_contactos"."prospecto_id" = 964 LIMIT 1

  solid #7F7F7F 1.0pt;padding:0in 0in 0in 0in'>
  <p class=MsoNormal><span lang=ES><%= printDescuento(@prospecto.plan_de_descuentos.first.descuento_en_la_inscripcion) %></span></p>
---
SELECT "plan_de_descuentos".* FROM "plan_de_descuentos" WHERE "plan_de_descuentos"."prospecto_id" = 964 LIMIT 1

<%
@tareas = Tarea.where(:model_name=>'prospectos').where(:model_id=>@prospecto.id).all
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "964"]]
SELECT "tareas".* FROM "tareas" WHERE "tareas"."model_name" = 'prospectos' AND "tareas"."model_id" = 964

	  "Times New Roman";color:windowtext;mso-font-kerning:0pt;font-style:normal;
	  mso-bidi-font-style:italic'><%=User.where(:id=>tarea.created_by).first.username rescue nil%></span></em><i style='mso-bidi-font-style:
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1


<%llamadas=Llamada.where(:model_name=>'prospectos').where(:model_id=>@prospecto.id).all%>
---
SELECT "llamadas".* FROM "llamadas" WHERE "llamadas"."model_name" = 'prospectos' AND "llamadas"."model_id" = 964


<%memos=Memo.where(:model_name=>'prospectos').where(:model_id=>@prospecto.id).all%>
---
SELECT "memos".* FROM "memos" WHERE "memos"."model_name" = 'prospectos' AND "memos"."model_id" = 964