app/views/homes/index.html.erb

                          <%tareastatus=""%>
                          <%tareas = Tarea.where(:model_name=>"prospectos").where(:model_id=>prospecto.id,:pendiente=>true).all%>
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."model_name" = 'inscritos' AND (("tareas"."model_id" = 13 AND "tareas"."pendiente" = 't'))

                            <%end%>
                          <%tareas = Llamada.where(:model_name=>"prospectos").where(:model_id=>prospecto.id,:pendiente=>true).all%>
---
SELECT "llamadas".* FROM "llamadas" WHERE "llamadas"."model_name" = 'inscritos' AND (("llamadas"."model_id" = 13 AND "llamadas"."pendiente" = 't'))

                            <%end%>
                            <%tareas = Memo.where(:model_name=>"prospectos").where(:model_id=>prospecto.id,:pendiente=>true).size%>
---
SELECT COUNT(*) FROM "memos" WHERE "memos"."model_name" = 'examinados' AND (("memos"."model_id" = 13 AND "memos"."pendiente" = 't'))

                              <%logger.debug "here!!!!!!!!!!!!!!!!!!!!!!1111111"%>
                            <%logger.debug solicitante.prospectos.first%>
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 5 LIMIT 1

                            <tr class="<%=tareastatus%>">
                        <td><%= link_to examinado.solicitantes.first.prospectos.first.nombre, examinado_path(examinado) %></td>
---
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."examinado_id" = 10 LIMIT 1

                            <%end%>
                            <%tareas = Memo.where(:model_name=>"examinados").where(:model_id=>admitido.id,:pendiente=>true).size%>
---
SELECT "examinados".* FROM "examinados" WHERE "examinados"."admitido_id" = 5 LIMIT 1

                            <tr class="<%=tareastatus%>">
                        <td><%= link_to inscrito.admitidos.first.examinados.first.solicitantes.first.prospectos.first.nombre, inscrito_path(inscrito) %></td>
---
SELECT "admitidos".* FROM "admitidos" WHERE "admitidos"."inscrito_id" = 13 LIMIT 1

        <td><%=solicitante.prospectos.first.apellido_materno%></td>
        <td><%=solicitante.prospectos.first.programa.nivel rescue nil%> - <%=solicitante.prospectos.first.programa.programa rescue nil%></td>
---
SELECT "programas".* FROM "programas" WHERE "programas"."id" = 3 LIMIT 1

                              var funnel<%=user.id%><%=programa.id%> = new RGraph.Funnel('cvs<%=user.id%><%=programa.id%>', [<%=@prospectosnovalidados.where(:programa_id=>programa.id).size + 1 %>,<%=@prospectosvalidados.where(:issolicitante=>false).where(:programa_id=>programa.id).size + 1 %>,<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante}.where{solicitantes.archivado==archivado}.where{solicitante.isexaminado==false}.where(:programa_id=>programa.id).size + 1 %>,<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante.examinado}.where{examinados.archivado==archivado}.where{solicitantes.archivado==archivado}.where{examinados.isadmitido==false}.where(:programa_id=>programa.id).size + 1 %>,<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante.examinado.admitido}.where{admitidos.archivado==archivado}.where{examinados.archivado==archivado}.where{solicitantes.archivado==archivado}.where{admitidos.isinscrito==false}.where(:programa_id=>programa.id).size + 1 %>,<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante.examinado.admitido.inscrito}.where{inscritos.archivado == archivado}.where{admitidos.archivado==archivado}.where{examinados.archivado==archivado}.where{solicitantes.archivado==archivado}.where(:programa_id=>programa.id).size + 1 %>]);
                              funnel<%=user.id%><%=programa.id%>.Set('chart.labels', ['Prospectos No Validados (<%=@prospectosnovalidados.where(:programa_id=>programa.id).size %>)','Prospectos Validados (<%=@prospectosvalidados.where(:issolicitante=>false).where(:programa_id=>programa.id).size %>)','Solicitantes (<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante}.where{solicitantes.archivado==archivado}.where{solicitante.isexaminado==false}.where(:programa_id=>programa.id).size  %>)','Examinados (<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante.examinado}.where{examinados.archivado==archivado}.where{solicitantes.archivado==archivado}.where{examinados.isadmitido==false}.where(:programa_id=>programa.id).size %>)',"Admitidos (<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante.examinado.admitido}.where{admitidos.archivado==archivado}.where{examinados.archivado==archivado}.where{solicitantes.archivado==archivado}.where{admitidos.isinscrito==false}.where(:programa_id=>programa.id).size %>)","Inscritos (<%=prospectosForUSer2.where(:user_id=>user.id).where(:sede_id=>sede.id).where(:archivado=>archivado).joins{solicitante.examinado.admitido.inscrito}.where{inscritos.archivado == archivado}.where{admitidos.archivado==archivado}.where{examinados.archivado==archivado}.where{solicitantes.archivado==archivado}.where(:programa_id=>programa.id).size  %>)"]);
---
SELECT COUNT(*) FROM "prospectos" INNER JOIN "solicitantes" ON "solicitantes"."id" = "prospectos"."solicitante_id" INNER JOIN "examinados" ON "examinados"."id" = "solicitantes"."examinado_id" INNER JOIN "admitidos" ON "admitidos"."id" = "examinados"."admitido_id" INNER JOIN "inscritos" ON "inscritos"."id" = "admitidos"."inscrito_id" WHERE "prospectos"."archivado" = 'f' AND "prospectos"."sede_id" = 1 AND "inscritos"."archivado" = 'f' AND "admitidos"."archivado" = 'f' AND "examinados"."archivado" = 'f' AND "solicitantes"."archivado" = 'f' AND "prospectos"."programa_id" = 3