app/views/dashboards/mispendientes.html.erb

SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 2 LIMIT 1
---

    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
---

  @rol = Role.where(:id=>current_user.role).first.nombre