app/views/configuraciones/_form.html.erb

  <%
rol = Role.where(:id=>current_user.role).first
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 2 LIMIT 1