app/controllers/admitidos_controller.rb

  def index
    archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
    if modelo != nil
      archivado = modelo.mostrar_archivados
    end
    if modelo == nil
      @admitidos = CompartidoLibreria.getAdmitidosForUser(current_user).where(:isinscrito=>false).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    else
      @admitidos = CompartidoLibreria.getAdmitidosForUser(current_user).where(:archivado=>archivado).where(:isinscrito=>false).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    end
        rol = Role.where(:id=>current_user.role).first
---
SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 6 LIMIT 1
SELECT "admitidos".* FROM "admitidos" WHERE "admitidos"."archivado" = 'f' AND "admitidos"."isinscrito" = 'f' ORDER BY id desc LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "admitidos" WHERE "admitidos"."archivado" = 'f' AND "admitidos"."isinscrito" = 'f'
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1

  def edit
    @admitido = Admitido.find(params[:id])
        @prospecto = @admitido.examinados.first.solicitantes.first.prospectos.first
      if @prospecto!=nil
        @tareas1 = Tarea.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @memos1 = Memo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @attachments1 = Attachment.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @llamadas1 = Llamada.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @correos1 = Correo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
---
SELECT "admitidos".* FROM "admitidos" WHERE "admitidos"."id" = ? LIMIT 1  [["id", "22"]]
SELECT "examinados".* FROM "examinados" WHERE "examinados"."id" = ? LIMIT 1  [["id", 25]]
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 32 LIMIT 1
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."id" = ? LIMIT 1  [["id", 32]]
SELECT "tareas".* FROM "tareas" WHERE (("tareas"."model_name" = 'prospectos' AND "tareas"."model_id" = 3674))
SELECT "memos".* FROM "memos" WHERE (("memos"."model_name" = 'prospectos' AND "memos"."model_id" = 3674))
SELECT "attachments".* FROM "attachments" WHERE (("attachments"."model_name" = 'prospectos' AND "attachments"."model_id" = 3674))
SELECT "llamadas".* FROM "llamadas" WHERE (("llamadas"."model_name" = 'prospectos' AND "llamadas"."model_id" = 3674))
SELECT "correos".* FROM "correos" WHERE (("correos"."model_name" = 'prospectos' AND "correos"."model_id" = 3674))