app/controllers/attachments_controller.rb

INSERT INTO "attachments" ("created_at", "created_by", "memo_id", "model_id", "model_name", "name", "sede_id", "tarea_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @attachment = Attachment.new(params[:attachment])

    if @attachment.model_id != nil
      respond_to do |format|
        if @attachment.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 2 LIMIT 1
SELECT "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy

      rol = Role.where(:id=>current_user.role).first

        if rol.nombre == "ACRM"

    @attachment = Attachment.find(params[:id])