app/controllers/colegiaturas_controller.rb

  def index
    rol = Role.where(:id=>current_user.role).first
    if rol.nombre == "D" or rol.nombre == "ACRM" or rol.nombre == "AL" or rol.nombre == "A"    or rol.nombre == "CP"
      @colegiaturas = Colegiatura.all
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "colegiaturas".* FROM "colegiaturas"