app/controllers/configuraciones_controller.rb

SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @configuracione = Configuracione.find(params[:id])