app/controllers/contactos_controller.rb

  def index
    @contactos = Contacto.all
---
SELECT "contactos".* FROM "contactos"