app/controllers/correos_controller.rb

  def send_correo
  #flash[:error] = 'Envio de correos temporalmente bloqueado'
  #redirect_to "/correos"
  #return
 archivado = false
            rol = Role.where(:id=>current_user.role).first
    modelo = Configuracione.where(:user_id=>user.id).first rescue nil

    if modelo != nil
      archivado = modelo.mostrar_archivados
    end

    @correo = Correo.find(params[:id])
    @correo.update_attributes(params[:correo])
    aquienSeAEnviado = []
    adjuntos = Attachment.where(:model_id=>@correo.id,:model_name=>"correos")
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 3 LIMIT 1
SELECT "correos".* FROM "correos" WHERE "correos"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "correos" SET "updated_at" = '2017-06-20 23:21:49.991764', "a_quien_enviarle_correo" = '---
SELECT "attachments".* FROM "attachments" WHERE (("attachments"."model_id" = 3 AND "attachments"."model_name" = 'correos'))

   if rol.nombre == "DN" or rol.nombre == "ACRM"
          mails=getProspectosForUser(current_user).where(:archivado=>archivado).where(:validado=>false).where(:issolicitante=> false).uniq
    else
          mails=getProspectosForUser(current_user).where(:archivado=>archivado).where(:validado=>false).where(:issolicitante=> false).where(:user_id=>@correo.user_id).uniq
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

   if rol.nombre == "DN" or rol.nombre == "ACRM"
          mails=getProspectosForUser(current_user).where(:archivado=>archivado).where(:validado=>false).where(:issolicitante=> false).uniq
    else
          mails=getProspectosForUser(current_user).where(:archivado=>archivado).where(:validado=>false).where(:issolicitante=> false).where(:sede_id=>@correo.sede_id).uniq
---
SELECT "sedes".* FROM "sedes" WHERE "sedes"."id" = 1 LIMIT 1

  def index
  rol = Role.where(:id=>current_user.role).first

   if rol.nombre == "DN" or rol.nombre == "ACRM"
      @search = Correo.ransack(params[:search])
      @correos = @search.result.paginate(:per_page => 15, :page => params[:page])
    else
      @search = Correo.where(:sede_id=>current_user.sede_id, :created_by=>current_user.id).ransack(params[:search])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "correos".* FROM "correos" LIMIT 15 OFFSET 0
SELECT "correos".* FROM "correos" WHERE (("correos"."sede_id" = 1 AND "correos"."created_by" = 3)) LIMIT 15 OFFSET 0

  def show
    @correo = Correo.find(params[:id])
---
SELECT "correos".* FROM "correos" WHERE "correos"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @correo = Correo.find(params[:id])
---
SELECT "correos".* FROM "correos" WHERE "correos"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @correo = Correo.new(params[:correo])

    respond_to do |format|
      if @correo.save
---
INSERT INTO "correos" ("a_quien_enviarle_correo", "campana_social_id", "created_at", "created_by", "es_uno_a_uno", "fechaparaenviar", "grupo_id", "liga_adjuntos", "mail_campana", "maildata", "model_id", "model_name", "nivel_id", "nombredelmail", "por_estado", "por_periodo", "programa_id", "sede_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @correo = Correo.find(params[:id])

    logger.debug "/////////////////////////////////////////////////////////////////////"
    logger.debug  params[:correo][:maildata]
    logger.debug "/////////////////////////////////////////////////////////////////////"
#<img src="https://www.willows-consulting.com/images/stories/Epicor-osCommerce.JPG" width="100%" height="100%" title="Image: https://www.willows-consulting.com/images/stories/Epicor-osCommerce.JPG">



    if params[:enviar] != nil

    end
    respond_to do |format|
      if @correo.update_attributes(params[:correo])
---
SELECT "correos".* FROM "correos" WHERE "correos"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "correos" SET "es_uno_a_uno" = 't', "mail_campana" = 'test@asd.com', "por_estado" = 0, "updated_at" = '2017-06-20 23:24:49.073529', "a_quien_enviarle_correo" = '---

  def destroy

rol = Role.where(:id=>current_user.role).first
        if rol.nombre == "ACRM"


    @correo = Correo.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 2 LIMIT 1
SELECT "correos".* FROM "correos" WHERE "correos"."id" = ? LIMIT 1  [["id", "2"]]