app/controllers/correos_controller.rb

            end
          end
        when "por_sedes"
          mails=Prospecto.where(:sede_id=>@correo.sede_id)
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."sede_id" = 1