app/controllers/division_territorials_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "division_territorials".* FROM "division_territorials"
---
  def index
    rol = Role.where(:id=>current_user.role).first
    if rol.nombre == "X"
      @division_territorials = DivisionTerritorial.all