app/controllers/examinados_controller.rb

  def index
    archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
    if modelo != nil
      archivado = modelo.mostrar_archivados
    end
    if modelo == nil
    @examinados = Shared.getExaminadosForUser(current_user).where(:isadmitido=>false).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    else
      @examinados = Shared.getExaminadosForUser(current_user).where(:archivado=>archivado).where(:isadmitido=>false).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    end
        rol = Role.where(:id=>current_user.role).first
---
SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 6 LIMIT 1
SELECT "examinados".* FROM "examinados" WHERE "examinados"."archivado" = 'f' AND "examinados"."isadmitido" = 'f' ORDER BY id desc LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "examinados" WHERE "examinados"."archivado" = 'f' AND "examinados"."isadmitido" = 'f'
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1

  def edit
    @examinado = Examinado.find(params[:id])
    @prospecto = @examinado.solicitantes.first.prospectos.first
      if @prospecto!=nil
        @tareas1 = Tarea.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @memos1 = Memo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @attachments1 = Attachment.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @llamadas1 = Llamada.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @correos1 = Correo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
---
SELECT "examinados".* FROM "examinados" WHERE "examinados"."id" = ? LIMIT 1  [["id", "25"]]
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 32 LIMIT 1
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."id" = ? LIMIT 1  [["id", 32]]
SELECT "tareas".* FROM "tareas" WHERE (("tareas"."model_name" = 'prospectos' AND "tareas"."model_id" = 3674))
SELECT "memos".* FROM "memos" WHERE (("memos"."model_name" = 'prospectos' AND "memos"."model_id" = 3674))
SELECT "attachments".* FROM "attachments" WHERE (("attachments"."model_name" = 'prospectos' AND "attachments"."model_id" = 3674))
SELECT "llamadas".* FROM "llamadas" WHERE (("llamadas"."model_name" = 'prospectos' AND "llamadas"."model_id" = 3674))
SELECT "correos".* FROM "correos" WHERE (("correos"."model_name" = 'prospectos' AND "correos"."model_id" = 3674))

  def convertir_examinado
    @examinado = Examinado.find(params[:id])
    @examinado.isadmitido=true
    @examinado.save

    examinado=@examinado
    newAdmitido=Admitido.create(:examinado_id=>examinado.id)
    newAdmitido.isinscrito = false
    newAdmitido.archivado =false
    newAdmitido.save
    @examinado.admitido_id = newAdmitido.id
    @examinado.save

    historial = History.new
    historial.model_name = "prospectos"
    historial.model_id = @examinado.solicitantes.first.prospectos.first.id
    historial.user_id = current_user.id
    historial.role = current_user.role
    historial.action = "Convertido en Admitido"
    historial.save
---
SELECT "examinados".* FROM "examinados" WHERE "examinados"."id" = ? LIMIT 1  [["id", "25"]]
UPDATE "admitidos" SET "isinscrito" = 'f', "archivado" = 'f', "updated_at" = '2015-09-27 16:33:52.759107' WHERE "admitidos"."id" = 22
UPDATE "examinados" SET "isadmitido" = 't', "updated_at" = '2015-09-27 16:33:52.605004' WHERE "examinados"."id" = 25
INSERT INTO "admitidos" ("archivado", "cartas_de_recomendacion", "cedula_profesional", "certificado_de_estudios", "comentarios_de_la_direccion", "comentarios_documentacion", "cometnarios_de_notificacion", "comprobante_de_domicilio", "comprobante_pago_inscripcion", "copia_del_acta_de_nacimiento", "copia_del_certificado_de_preparatoria_licenciatura", "copia_del_comprobante_de_pago_de_inscripcion", "created_at", "curp", "curriculum_vitae", "examinado_id", "fecha_lim_fpi", "fotografias_tamano_infantil_blanco_y_negro_papel_mate", "identificacion_oficial", "inscrito_id", "isinscrito", "periodo_para_ingresar_id", "solicitud_de_admision", "solicitud_de_beca", "status_admision", "status_de_admision_id", "status_de_la_notificacion", "status_de_la_notificacion_id", "status_del_admitido", "status_del_admitido_id", "status_ref_pago_insc", "status_ref_pago_insc_id", "titulo_profesional", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 32 LIMIT 1
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."examinado_id" = 25 LIMIT 1
INSERT INTO "histories" ("action", "created_at", "model_id", "model_name", "role", "updated_at", "user_id", "when") VALUES (?, ?, ?, ?, ?, ?, ?, ?)