app/controllers/homes_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 2 LIMIT 1
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."examinado_id" = 2 LIMIT 1
SELECT "examinados".* FROM "examinados" WHERE "examinados"."admitido_id" = 1 LIMIT 1
SELECT "admitidos".* FROM "admitidos" WHERE "admitidos"."inscrito_id" = 1 LIMIT 1
---
  def index
    archivado = false
            rol = Role.where(:id=>current_user.role).first
    modelo = Configuracione.where(:user_id=>user.id).first rescue nil

    if modelo != nil
      archivado = modelo.mostrar_archivados
    end
    if modelo == nil

      if rol.nombre == "ACRM"  or rol.nombre == "DN"
        @prospectosnovalidados=CompartidoLibreria.getProspectosForUser(current_user).where(:validado=>false).where(:issolicitante=> false).limit(5)
        @prospectosvalidados=CompartidoLibreria.getProspectosForUser(current_user).where(:validado=>true).where(:issolicitante=> false).limit(5)
        @solicitantes=CompartidoLibreria.getSolicitantesForUser(current_user).where(:isexaminado=> false).all(:limit=>5)
        @examinados=CompartidoLibreria.getExaminadosForUser(current_user).where(:isadmitido=>false).all(:limit=>5)
        @admitidos=CompartidoLibreria.getAdmitidosForUser(current_user).where(:isinscrito=>false).all(:limit=>5)

SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."archivado" = 'f' AND "prospectos"."validado" = 'f' AND "prospectos"."issolicitante" = 'f' LIMIT 5
SELECT "examinados".* FROM "examinados" WHERE "examinados"."archivado" = 'f' AND (solicitante_id in (1,2,3,4,5,7,8,9,10,12,13,14))
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."isexaminado" = 'f' AND "solicitantes"."archivado" = 'f' LIMIT 5
SELECT "admitidos".* FROM "admitidos" WHERE "admitidos"."archivado" = 'f' AND (examinado_id in (1,2,3,4,6,9,10))
SELECT "examinados".* FROM "examinados" WHERE "examinados"."archivado" = 'f' AND "examinados"."isadmitido" = 'f' AND (solicitante_id in (1,2,3,4,5,7,8,9,10,12,13,14)) LIMIT 5
SELECT "admitidos".* FROM "admitidos" WHERE "admitidos"."archivado" = 'f' AND "admitidos"."isinscrito" = 'f' AND (examinado_id in (1,2,3,4,6,9,10)) LIMIT 5
SELECT "inscritos".* FROM "inscritos" WHERE "inscritos"."archivado" = 'f' AND (admitido_id in (1,2,3,5)) LIMIT 5
---
    end
  else
    if rol.nombre == "ACRM"   or rol.nombre == "DN"
      @prospectosnovalidados=CompartidoLibreria.getProspectosForUser(current_user).where(:archivado=>archivado).where(:validado=>false).where(:issolicitante=> false).limit(5)
      @prospectosvalidados=CompartidoLibreria.getProspectosForUser(current_user).where(:archivado=>archivado).where(:validado=>true).where(:issolicitante=> false).limit(5)
      @solicitantes=CompartidoLibreria.getSolicitantesForUser(current_user).where(:isexaminado=> false).where(:archivado=>archivado).where(:isexaminado=> false).all(:limit=>5)
      @examinados=CompartidoLibreria.getExaminadosForUser(current_user).where(:archivado=>archivado).where(:isadmitido=>false).all(:limit=>5)
      @admitidos=CompartidoLibreria.getAdmitidosForUser(current_user).where(:archivado=>archivado).where(:isinscrito=>false).all(:limit=>5)