app/controllers/inscritos_controller.rb

SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 6 LIMIT 1
SELECT "inscritos".* FROM "inscritos" WHERE "inscritos"."archivado" = 'f' ORDER BY id desc LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "inscritos" WHERE "inscritos"."archivado" = 'f'
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
---
  def index
    archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
    if modelo != nil
      archivado = modelo.mostrar_archivados
    end
    if modelo == nil
    @inscritos = CompartidoLibreria.getInscritosForUser(current_user).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    else
      @inscritos = CompartidoLibreria.getInscritosForUser(current_user).where(:archivado=>archivado).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    end

        rol = Role.where(:id=>current_user.role).first