app/controllers/llamadas_controller.rb

INSERT INTO "llamadas" ("asunto", "aviso", "comentarios", "created_at", "created_by", "duracion", "duracion_texto", "efectividad", "estado", "fin_de_la_llamada", "inicio_de_la_llamada", "model_id", "model_name", "pendiente", "sede_id", "tiempo_de_fin", "tiempo_de_inicio", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @llamada = Llamada.new(params[:llamada])

    if @llamada.inicio_de_la_llamada!=nil and @llamada.inicio_de_la_llamada.to_date > Date.today
      @llamada.pendiente = true
    end

    respond_to do |format|
      if @llamada.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 2 LIMIT 1
SELECT "llamadas".* FROM "llamadas" WHERE "llamadas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy


rol = Role.where(:id=>current_user.role).first
        if rol.nombre == "ACRM"

    @llamada = Llamada.find(params[:id])