app/controllers/memos_controller.rb

  def edit
    @memo = Memo.find(params[:id])
---
SELECT "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @memo = Memo.new(params[:memo])

    respond_to do |format|
      if @memo.save
---
INSERT INTO "memos" ("comentarios", "created_at", "created_by", "descripcion", "model_id", "model_name", "nombre", "pendiente", "sede_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy


rol = Role.where(:id=>current_user.role).first
        if rol.nombre == "ACRM"

    @memo = Memo.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 2 LIMIT 1
SELECT "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT 1  [["id", "1"]]