app/controllers/metas_globales_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "metas_globales".* FROM "metas_globales"
---
  def index
    rol = Role.where(:id=>current_user.role).first
    if rol.nombre == "D" or rol.nombre == "ACRM" or rol.nombre == "AL" or rol.nombre == "A"    or rol.nombre == "CP"
      @metas_globales = MetasGlobale.all