app/controllers/mi_plan_estrategico_de_promocion_peps_controller.rb

  def index

 @mi_plan_estrategico_de_promocion_peps = MiPlanEstrategicoDePromocionPep.all
---
SELECT "mi_plan_estrategico_de_promocion_peps".* FROM "mi_plan_estrategico_de_promocion_peps"

  def show
    @mi_plan_estrategico_de_promocion_pep = MiPlanEstrategicoDePromocionPep.find(params[:id])
---
SELECT "mi_plan_estrategico_de_promocion_peps".* FROM "mi_plan_estrategico_de_promocion_peps" WHERE "mi_plan_estrategico_de_promocion_peps"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @mi_plan_estrategico_de_promocion_pep = MiPlanEstrategicoDePromocionPep.find(params[:id])
        @tareas = Tarea.where(:model_name=>"mi_plan_estrategico_de_promocion_peps",:model_id=>@mi_plan_estrategico_de_promocion_pep.id)
    @memos = Memo.where(:model_name=>"mi_plan_estrategico_de_promocion_peps",:model_id=>@mi_plan_estrategico_de_promocion_pep.id)
    @attachments = Attachment.where(:model_name=>"mi_plan_estrategico_de_promocion_peps",:model_id=>@mi_plan_estrategico_de_promocion_pep.id)
    @llamadas = Llamada.where(:model_name=>"mi_plan_estrategico_de_promocion_peps",:model_id=>@mi_plan_estrategico_de_promocion_pep.id)
    @correos = Correo.where(:model_name=>"mi_plan_estrategico_de_promocion_peps",:model_id=>@mi_plan_estrategico_de_promocion_pep.id)
---
SELECT "mi_plan_estrategico_de_promocion_peps".* FROM "mi_plan_estrategico_de_promocion_peps" WHERE "mi_plan_estrategico_de_promocion_peps"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tareas".* FROM "tareas" WHERE (("tareas"."model_name" = 'mi_plan_estrategico_de_promocion_peps' AND "tareas"."model_id" = 1))
SELECT "memos".* FROM "memos" WHERE (("memos"."model_name" = 'mi_plan_estrategico_de_promocion_peps' AND "memos"."model_id" = 1))
SELECT "attachments".* FROM "attachments" WHERE (("attachments"."model_name" = 'mi_plan_estrategico_de_promocion_peps' AND "attachments"."model_id" = 1))
SELECT "llamadas".* FROM "llamadas" WHERE (("llamadas"."model_name" = 'mi_plan_estrategico_de_promocion_peps' AND "llamadas"."model_id" = 1))
SELECT "correos".* FROM "correos" WHERE (("correos"."model_name" = 'mi_plan_estrategico_de_promocion_peps' AND "correos"."model_id" = 1))

  def create
    @mi_plan_estrategico_de_promocion_pep = MiPlanEstrategicoDePromocionPep.new(params[:mi_plan_estrategico_de_promocion_pep])

    respond_to do |format|
      if @mi_plan_estrategico_de_promocion_pep.save
---
INSERT INTO "mi_plan_estrategico_de_promocion_peps" ("asesor_a_cargo", "calle", "cargo", "codigo_postal", "colonia", "created_at", "delegacion_municipio", "email", "estado", "ext", "forma_parte_de_mi_mdo_meta", "google_maps", "latitude", "longitude", "mercado_meta_observaciones", "movil", "no_de_admitidos", "no_de_entrevistados_examinados", "no_de_inscritos", "no_exterior", "no_interior", "no_solicitantes", "nombre_de_la_institucion", "nombre_de_los_admitidos", "nombre_de_los_entrevistados_examinados", "nombre_de_los_inscritos", "nombre_de_los_solicitantes", "nse", "observaciones", "otro_telefono", "pag_web", "pais", "pep_para", "periodo_anual", "persona_de_contacto", "sede_id", "segmento", "tamano_de_mdo_que_aspira_abarcar", "telefono_de_oficina", "tipo_especifico", "total_de_prospectos_obtenidos", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @mi_plan_estrategico_de_promocion_pep = MiPlanEstrategicoDePromocionPep.find(params[:id])

    respond_to do |format|
      if @mi_plan_estrategico_de_promocion_pep.update_attributes(params[:mi_plan_estrategico_de_promocion_pep])
---
SELECT "mi_plan_estrategico_de_promocion_peps".* FROM "mi_plan_estrategico_de_promocion_peps" WHERE "mi_plan_estrategico_de_promocion_peps"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "mi_plan_estrategico_de_promocion_peps" SET "user_id" = 2, "updated_at" = '2017-07-01 19:39:01.458318' WHERE "mi_plan_estrategico_de_promocion_peps"."id" = 1