app/controllers/nacional_de_aperturas_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "nacional_de_aperturas".* FROM "nacional_de_aperturas"
---
  def index
    rol = Role.where(:id=>current_user.role).first
    if rol.nombre == "D" or rol.nombre == "ACRM" or rol.nombre == "AL" or rol.nombre == "A"    or rol.nombre == "CP"
      @nacional_de_aperturas = NacionalDeApertura.all