app/controllers/oferta_educativas_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "oferta_educativas".* FROM "oferta_educativas"
---
  def index

    rol = Role.where(:id=>current_user.role).first
    if rol.nombre == "X"
      @oferta_educativas = OfertaEducativa.all