app/controllers/programas_controller.rb

SELECT "programas".* FROM "programas"
---
  def index
    @programas = Programa.all

SELECT "programas".* FROM "programas" WHERE "programas"."id" = ? LIMIT 1  [["id", "29"]]
---
  def show
    @programa = Programa.find(params[:id])

SELECT "programas".* FROM "programas" WHERE "programas"."id" = ? LIMIT 1  [["id", "8"]]
---
  def edit
    @programa = Programa.find(params[:id])

INSERT INTO "programas" ("created_at", "descripcion_detallada", "nivel", "principales_beneficios", "principales_caracteristicas", "principales_ventajas", "programa", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @programa = Programa.new(params[:programa])

    respond_to do |format|
      if @programa.save

SELECT "programas".* FROM "programas" WHERE "programas"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "programas" SET "nivel" = 'Maestria', "descripcion_detallada" = '', "principales_caracteristicas" = '', "principales_ventajas" = '', "principales_beneficios" = '', "updated_at" = '2015-09-27 16:29:56.556099' WHERE "programas"."id" = 8
---
  def update
    @programa = Programa.find(params[:id])

    respond_to do |format|
      if @programa.update_attributes(params[:programa])