app/controllers/prospectos_controller.rb

  def cambiarmultiple
    @valores = params
    @psm = params["/cambiarmultiple"]
    @q = getProspectosForUser(current_user).ransack(params[:q])
    @prospectos = @q.result(:distinct => true).where(:issolicitante=> false)

    if not @psm[:fieldvaluetext].present?
     redirect_to mostrarmultiple_path(:q=>params[:q]) , :flash => { :error => "Por favor seleccione un valor para el campo seleccionado." }
     return
    end
    @prospectos.update_all("#{@psm[:fieldname]} = #{@psm[:fieldvaluetext]}")
---
UPDATE "prospectos" SET telefono_particular = 666666666 WHERE "prospectos"."id" IN (SELECT "prospectos"."id" FROM "prospectos" LEFT OUTER JOIN "interes_basicos" ON "interes_basicos"."prospecto_id" = "prospectos"."id" LEFT OUTER JOIN "subsedes" ON "subsedes"."id" = "interes_basicos"."subsede_id" WHERE "prospectos"."archivado" = 'f' AND "subsedes"."nombre" LIKE '%aaa%' AND "prospectos"."issolicitante" = 'f')

  def mostrarmultiple
     archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
    if modelo != nil
      archivado = modelo.mostrar_archivados
    end
    # @prospectos = Prospecto.all
    # or (current_user.role =="director")
    logger.debug "-----------------------"
    logger.debug current_user.inspect
    logger.debug "--------------------"
    rol = Role.where(:id=>current_user.role).first
---
SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 2 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1

  def index
    archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
---
SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 2 LIMIT 1

    logger.debug "-----------------------"
    logger.debug current_user.inspect
    logger.debug "--------------------"
    rol = Role.where(:id=>current_user.role).first
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1

  def show
    @prospecto = Prospecto.find(params[:id])
    @activities = PublicActivity::Activity.all
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "768"]]
SELECT "activities".* FROM "activities"

  def edit
    @prospecto = Prospecto.find(params[:id])
      if @prospecto!=nil
        @tareas1 = Tarea.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @memos1 = Memo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @attachments1 = Attachment.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @llamadas1 = Llamada.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @correos1 = Correo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "767"]]
SELECT "tareas".* FROM "tareas" WHERE (("tareas"."model_name" = 'prospectos' AND "tareas"."model_id" = 767))
SELECT "memos".* FROM "memos" WHERE (("memos"."model_name" = 'prospectos' AND "memos"."model_id" = 767))
SELECT "attachments".* FROM "attachments" WHERE (("attachments"."model_name" = 'prospectos' AND "attachments"."model_id" = 767))
SELECT "llamadas".* FROM "llamadas" WHERE (("llamadas"."model_name" = 'prospectos' AND "llamadas"."model_id" = 767))
SELECT "correos".* FROM "correos" WHERE (("correos"."model_name" = 'prospectos' AND "correos"."model_id" = 767))

  def printview
    @prospecto = Prospecto.find(params[:id])
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "964"]]

  def update
    @prospecto = Prospecto.find(params[:id])

    respond_to do |format|
      if @prospecto.update_attributes(params[:prospecto])
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "3674"]]
UPDATE "prospectos" SET "nacionalidad_id" = 1, "otro_telefono" = '', "facebook" = '', "twitter" = '', "grupo_id" = 1, "importado_revisado" = 't', "updated_at" = '2015-09-27 16:32:17.609361' WHERE "prospectos"."id" = 3674

  def validar
    @prospecto = Prospecto.find(params[:id])
        historial = History.new
        historial.model_name = "prospectos"
        historial.model_id = @prospecto.id
        historial.user_id = current_user.id
        historial.role = current_user.role
        historial.action = "Validado"
        historial.save
        @prospecto.validado=true
        @prospecto.importado_revisado=true
        @prospecto.save
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "767"]]
INSERT INTO "histories" ("action", "created_at", "model_id", "model_name", "role", "updated_at", "user_id", "when") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "prospectos" SET "validado" = 't', "importado_revisado" = 't', "updated_at" = '2017-06-13 23:38:39.058136' WHERE "prospectos"."id" = 768

  def convertir
    @prospecto = Prospecto.find(params[:id])
    @prospecto.issolicitante=true
    @prospecto.save

    hasInscritoAlready = Solicitante.where(:prospecto_id=>@prospecto.id).first
    if hasInscritoAlready != nil
      redirect_to edit_solicitante_path(hasInscritoAlready), :flash => { :info => "Prospecto ya habia sido convertido." }
      return
    end

    prospecto=@prospecto
    newsolicitante=Solicitante.create(:prospecto_id=>@prospecto.id)
    newbecacredit=Becacredito.create(:solicitante=>newsolicitante)
    @prospecto.solicitante_id = newsolicitante.id
    @prospecto.save
        historial = History.new
        historial.model_name = "prospectos"
        historial.model_id = @prospecto.id
        historial.user_id = current_user.id
        historial.role = current_user.role
        historial.action = "Convertido en Solicitante"
        historial.save
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."id" = ? LIMIT 1  [["id", "767"]]
UPDATE "prospectos" SET "solicitante_id" = 14, "updated_at" = '2017-06-13 23:36:08.624618' WHERE "prospectos"."id" = 767
UPDATE "solicitantes" SET "isexaminado" = 'f', "archivado" = 'f', "updated_at" = '2017-06-13 23:36:08.648427' WHERE "solicitantes"."id" = 14
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."prospecto_id" = 767 LIMIT 1
INSERT INTO "solicitantes" ("archivado", "asistio_a_entrevista", "comentarios", "created_at", "examinado_id", "fecha_de_limite_de_pago_examen_de_admision", "fecha_programacion_para_PAA", "fecha_programacion_para_examenes_pscicomentricos", "fecha_programada_para_entrevistas", "hora_programada_PAA", "hora_programada_entrevistas", "hora_programada_pscicometrico", "isexaminado", "nueva_fecha_para_entrevista", "nueva_hora_para_entrevista", "promedio", "prospecto_id", "socilicita_PAA", "solicita_entrevista_academica", "solicita_pscicometria", "status_de_pago_de_examen_de_admision_id", "status_depago_examen_de_admision", "tipo_de_admision", "tipo_de_admision_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "becacreditos" ("blank", "comentarios", "comentarios_dictamen_beca", "created_at", "estimado_de_pago_mensual_de_colegiatura", "fecha_limite_de_aplicacion_ESE", "fecha_limite_de_pago_ESE", "porcentaje_de_beca_concedido", "porcentaje_de_beca_credito", "porcentaje_de_beca_sugerido_ESE", "porcentaje_de_credito_concedido", "porcentaje_de_credito_solicitado", "porcentaje_de_credito_sugerido_ESE", "solicitante_id", "solicitud_de_beca_credito", "status_de_ESE", "status_de_ese_id", "status_de_pago_ESE", "status_de_pago_ese_id", "status_del_tramite", "status_del_tramite_de_beca_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "histories" ("action", "created_at", "model_id", "model_name", "role", "updated_at", "user_id", "when") VALUES (?, ?, ?, ?, ?, ?, ?, ?)