app/controllers/prospectos_controller.rb

  def index
    archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
    if modelo != nil
      archivado = modelo.mostrar_archivados
    end
    # @prospectos = Prospecto.all
    # or (current_user.role =="director")
    logger.debug "-----------------------"
    logger.debug current_user.inspect
    logger.debug "--------------------"
    rol = Role.where(:id=>current_user.role).first

    if request.path_parameters[:format] != 'xls'
      if rol.nombre == "D" or rol.nombre == "ACRM" or rol.nombre == "AL" or rol.nombre == "A"    or rol.nombre == "CP"
          @q = Prospecto.ransack(params[:q])
          @prospectos = @q.result(:distinct => true).where(:archivado=>archivado).where(:issolicitante=> false).paginate(:per_page => 50, :page => params[:page])
---
SELECT COUNT(DISTINCT "prospectos"."id") FROM "prospectos" WHERE "prospectos"."archivado" = 'f' AND "prospectos"."issolicitante" = 'f'
SELECT DISTINCT "prospectos".* FROM "prospectos" WHERE "prospectos"."archivado" = 'f' AND "prospectos"."issolicitante" = 'f' LIMIT 50 OFFSET 0