app/controllers/roles_controller.rb

  def edit
    @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1