app/controllers/searches_controller.rb

  def index
    @searches = Search.where(:user_id=>current_user.id)
---
SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = 2

  def edit
    @search = Search.find(params[:id])
---
SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy


rol = Role.where(:id=>current_user.role).first
        if rol.nombre == "ACRM"


    @search = Search.find(params[:id])
    @search.destroy
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "searches" WHERE "searches"."id" = ?  [["id", 1]]

  def saved_search
    @saved_search = Search.create(params[:search])
---
INSERT INTO "searches" ("content", "created_at", "description", "model_name", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def redir_to_saved
    logger.debug "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
    vtec = params[:search][:name]
    logger.debug vtec
    logger.debug "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
    okSearch = Search.where(:name=>vtec,:user_id=>params[:search][:user_id],:model_name=>params[:search][:model_name]).first
---
SELECT "searches".* FROM "searches" WHERE (("searches"."name" = 'test' AND "searches"."user_id" = 6 AND "searches"."model_name" = 'searches')) LIMIT 1