app/controllers/solicitantes_controller.rb

  def index
    archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
    if modelo != nil
      archivado = modelo.mostrar_archivados
    end


    if modelo == nil
    @solicitantes = CompartidoLibreria.getSolicitantesForUser(current_user).where(:isexaminado=>false).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    else
      @solicitantes = CompartidoLibreria.getSolicitantesForUser(current_user).where(:archivado=>archivado).where(:isexaminado=>false).order(sort_column + " " + sort_direction).paginate(:per_page => 15, :page => params[:page])
    end


    archivado = false
    modelo = Configuracione.where(:user_id=>current_user.id).first rescue nil
    if modelo != nil
      archivado = modelo.mostrar_archivados
    end

    rol = Role.where(:id=>current_user.role).first
---
SELECT "configuraciones".* FROM "configuraciones" WHERE "configuraciones"."user_id" = 6 LIMIT 1
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."archivado" = 'f' AND "solicitantes"."isexaminado" = 'f' ORDER BY id desc LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "solicitantes" WHERE "solicitantes"."archivado" = 'f' AND "solicitantes"."isexaminado" = 'f'
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1

  def edit
    @solicitante = Solicitante.find(params[:id])
    @prospecto = @solicitante.prospectos.first
      if @prospecto!=nil
        @tareas1 = Tarea.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @memos1 = Memo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @attachments1 = Attachment.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @llamadas1 = Llamada.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
        @correos1 = Correo.where(:model_name=>"prospectos",:model_id=>@prospecto.id)
---
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."id" = ? LIMIT 1  [["id", "14"]]
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 14 LIMIT 1
SELECT "tareas".* FROM "tareas" WHERE (("tareas"."model_name" = 'prospectos' AND "tareas"."model_id" = 767))
SELECT "memos".* FROM "memos" WHERE (("memos"."model_name" = 'prospectos' AND "memos"."model_id" = 767))
SELECT "attachments".* FROM "attachments" WHERE (("attachments"."model_name" = 'prospectos' AND "attachments"."model_id" = 767))
SELECT "llamadas".* FROM "llamadas" WHERE (("llamadas"."model_name" = 'prospectos' AND "llamadas"."model_id" = 767))
SELECT "correos".* FROM "correos" WHERE (("correos"."model_name" = 'prospectos' AND "correos"."model_id" = 767))

  def convertir_solicitante
    @solicitante = Solicitante.find(params[:id])
    @solicitante.isexaminado=true
    solicitante=@solicitante
    newexaminado=Examinado.create(:solicitante_id=>solicitante.id)
    newexaminado.isadmitido = false
    newexaminado.archivado =false
    newexaminado.save
    @solicitante.examinado_id = newexaminado.id
    @solicitante.save
    historial = History.new
    historial.model_name = "prospectos"
    historial.model_id = @solicitante.prospectos.first.id
    historial.user_id = current_user.id
    historial.role = current_user.role
    historial.action = "Convertido en Examinado"
    historial.save
---
SELECT "solicitantes".* FROM "solicitantes" WHERE "solicitantes"."id" = ? LIMIT 1  [["id", "32"]]
INSERT INTO "examinados" ("admitido_id", "archivado", "comentarios_asesor", "comentarios_coord", "comentarios_evaluador_paa", "comentarios_psico", "created_at", "dictamen_academico", "dictamen_psico", "dictament_paa", "isadmitido", "puntaje_total_paa", "puntuacion_MMPI", "puntuacion_matematicas", "puntuacion_redaccion_indirecta", "puntuacion_verbal", "solicitante_id", "status_del_examinado_entrevista", "status_del_examinado_entrevista_id", "status_del_examinado_entrevistum_id", "status_del_examinado_paa", "status_del_examinado_paa_id", "status_del_examinado_psico", "status_del_examinado_psico_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "examinados" SET "isadmitido" = 'f', "archivado" = 'f', "updated_at" = '2015-09-27 16:33:33.997028' WHERE "examinados"."id" = 25
UPDATE "solicitantes" SET "isexaminado" = 't', "examinado_id" = 25, "updated_at" = '2015-09-27 16:33:34.021044' WHERE "solicitantes"."id" = 32
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 32 LIMIT 1
INSERT INTO "histories" ("action", "created_at", "model_id", "model_name", "role", "updated_at", "user_id", "when") VALUES (?, ?, ?, ?, ?, ?, ?, ?)