app/controllers/tareas_controller.rb

  def show
    @tarea = Tarea.find(params[:id])
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."id" = ? LIMIT 1  [["id", "4"]]

  def edit
    @tarea = Tarea.find(params[:id])
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @tarea = Tarea.new(params[:tarea])

logger.debug "///////////////////////////////////"
    logger.debug @tarea.model_id
    logger.debug "///////////////////////////////////"


    if @tarea.model_id != nil
      respond_to do |format|
        if @tarea.save
---
INSERT INTO "tareas" ("attachment", "comentarios", "created_at", "created_by", "descripcion", "fecha_de_fin_de_la_tarea", "fecha_de_inicio_de_la_tarea", "hora_de_fin", "hora_de_inicio", "model_id", "model_name", "nombre", "pendiente", "sede_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy

rol = Role.where(:id=>current_user.role).first
        if rol.nombre == "ACRM"


    @tarea = Tarea.find(params[:id])
    @tarea.destroy
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 9 LIMIT 1
SELECT "tareas".* FROM "tareas" WHERE "tareas"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "tareas" WHERE "tareas"."id" = ?  [["id", 2]]