app/views/achievments/_form.html.erb

SELECT "nivels".* FROM "nivels"
SELECT "programas".* FROM "programas"
---
            <%=f.input :programa_id,:label=>"Programa" do%>
              <%= f.select :programa_id , Programa.all.map{ |c| ["" + c.nivel + "-" + c.programa, c.id] }%>