app/views/solicitantes/index.html.erb

                         <%tareastatus=""%>
                          <%tareas = Tarea.where(:model_name=>"solicitantes").where(:model_id=>solicitante.id,:pendiente=>true).all%>
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."model_name" = 'solicitantes' AND (("tareas"."model_id" = 32 AND "tareas"."pendiente" = 't'))

                            <%end%>
                          <%tareas = Llamada.where(:model_name=>"solicitantes").where(:model_id=>solicitante.id,:pendiente=>true).all%>
---
SELECT "llamadas".* FROM "llamadas" WHERE "llamadas"."model_name" = 'solicitantes' AND (("llamadas"."model_id" = 32 AND "llamadas"."pendiente" = 't'))

                            <%end%>
                            <%tareas = Memo.where(:model_name=>"solicitantes").where(:model_id=>solicitante.id,:pendiente=>true).size%>
---
SELECT COUNT(*) FROM "memos" WHERE "memos"."model_name" = 'solicitantes' AND (("memos"."model_id" = 32 AND "memos"."pendiente" = 't'))

      <tr>
        <%if solicitante.prospectos.first == nil%>
---
SELECT "prospectos".* FROM "prospectos" WHERE "prospectos"."solicitante_id" = 32 LIMIT 1

          <td><%= link_to solicitante_path(solicitante) do %>
              <%=solicitante.prospectos.first.programa.nivel rescue nil%> - <%=solicitante.prospectos.first.programa.programa rescue nil%>
---
SELECT "programas".* FROM "programas" WHERE "programas"."id" = 8 LIMIT 1